# 10 min to Pandas

In [2]:
import numpy as np
import pandas as pd

- Series je jednorozměrné pojmenované pole (podobné seznamu s indexem)
- DataFrame je dvourozměrná tabulka (řádky a sloupce)
    - V tabulce DataFrame má každý sloupec svůj datový typ, může obsahovat čísla, text, data atd. (např. pd.DataFrame({'A':[1,2],'B':[3,4]}) vytvoří tabulku s dvěma sloupci).

In [3]:
s = pd.Series([1,2,3,5,np.nan,6,7,8,9])
s

0    1.0
1    2.0
2    3.0
3    5.0
4    NaN
5    6.0
6    7.0
7    8.0
8    9.0
dtype: float64

In [ ]:
datas = pd.date_range("20130101", periods=6)
datas

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=datas, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.293374  0.583665  0.139719  0.004465
2013-01-02 -1.385504  0.355160 -2.043226  0.048585
2013-01-03 -1.163600  0.279948  1.331084 -1.498096
2013-01-04  1.216198  0.066957  1.098287  1.439191
2013-01-05  0.316066  1.288773 -0.536286  0.600657
2013-01-06  0.064484  1.724579 -0.251974 -1.250088

- vytvoreni DataFrame tak, ze pridame slovnik objektu, kde klice jsou sloupce

In [8]:
df2 = pd.DataFrame({
    "A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] * 4, dtype="int32"),
    "E" : pd.Categorical(["test", "train", "test", "train"]),
    "F" : "foo"
})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [10]:
df2.D

0    3
1    3
2    3
3    3
Name: D, dtype: int32

In [13]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.tail(5)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df2.index

Index([0, 1, 2, 3], dtype='int64')

In [17]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.109831  0.716514 -0.043733 -0.109214
std    0.986962  0.648755  1.225719  1.110845
min   -1.385504  0.066957 -2.043226 -1.498096
25%   -0.856579  0.298751 -0.465208 -0.936450
50%    0.178929  0.469412 -0.056127  0.026525
75%    0.310393  1.112496  0.858645  0.462639
max    1.216198  1.724579  1.331084  1.439191

In [20]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [24]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [26]:
df[3:6]

                   A         B         C         D
2013-01-04  1.216198  0.066957  1.098287  1.439191
2013-01-05  0.316066  1.288773 -0.536286  0.600657
2013-01-06  0.064484  1.724579 -0.251974 -1.250088

In [28]:
df.loc[datas[4]]

A    0.316066
B    1.288773
C   -0.536286
D    0.600657
Name: 2013-01-05 00:00:00, dtype: float64